src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/heatTransfer/buoyantPimpleFoam/hotRoomWithThermalShell/system/faOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

topSide
{
    type                                externalHeatFluxSource;
    active                              true;
    region                              ceilingShell;
    T                                   Ts_ceilingShell;
    selectionMode                       all;
    mode                                coefficient;
    Ta                                  constant 290;
    h                                   10;

}

// contactHeatFluxSource is the coupling of the shell-2D and the 3D mesh
contactHeatFlux
{
    type                                contactHeatFluxSource;
    active                              true;
    T                                   Ts_ceilingShell;
    region                              ceilingShell;

    Tprimary                            T;

    kappaMethod                         fluidThermo;
    kappa                               none;

    thicknessLayers                     (0.001);
    kappaLayers                         (0.02);

    selectionMode                       all;
}


//************************************************************************** //
